# 19. Реализовать алгоритм задания случайных чисел. Без использования встроенного генератора псевдослучайных чисел
# WTF

# Хрень какая-то магическая
def new_set():
    set_ = set()
    for i in range(0,50):
        set_.add(str(i))
    return set_        

# X(n+1) = (A * X(n)+B) % M
# A =
# B = 
# C = 
# M = 

print(new_set())